#### Terraform Initialization `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
data.sops_file.secrets: Reading...
data.sops_file.secrets: Read complete after 0s [id=-]
data.azuread_application_published_app_ids.well_known: Reading...
data.azuread_application_published_app_ids.well_known: Read complete after 0s [id=appIds]
data.azuread_user.admin: Reading...
data.azuread_user.admin: Read complete after 1s [id=74953878-8eaf-421b-b557-b2485367566c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_app_role_assignment.argocd_administrators will be created
  + resource "azuread_app_role_assignment" "argocd_administrators" {
      + app_role_id            = "00000000-0000-0000-0000-000000000000"
      + id                     = (known after apply)
      + principal_display_name = (known after apply)
      + principal_object_id    = (known after apply)
      + principal_type         = (known after apply)
      + resource_display_name  = (known after apply)
      + resource_object_id     = (known after apply)
    }

  # azuread_app_role_assignment.pomerium_administrators will be created
  + resource "azuread_app_role_assignment" "pomerium_administrators" {
      + app_role_id            = "00000000-0000-0000-0000-000000000000"
      + id                     = (known after apply)
      + principal_display_name = (known after apply)
      + principal_object_id    = (known after apply)
      + principal_type         = (known after apply)
      + resource_display_name  = (known after apply)
      + resource_object_id     = (known after apply)
    }

  # azuread_app_role_assignment.proxmox_administrators will be created
  + resource "azuread_app_role_assignment" "proxmox_administrators" {
      + app_role_id            = "00000000-0000-0000-0000-000000000000"
      + id                     = (known after apply)
      + principal_display_name = (known after apply)
      + principal_object_id    = (known after apply)
      + principal_type         = (known after apply)
      + resource_display_name  = (known after apply)
      + resource_object_id     = (known after apply)
    }

  # azuread_application.argocd will be created
  + resource "azuread_application" "argocd" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "Argo CD"
      + group_membership_claims     = [
          + "ApplicationGroup",
        ]
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 2
        }

      + feature_tags {
          + enterprise = true
          + gallery    = false
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = (known after apply)
              + type = "Scope"
            }
          + resource_access {
              + id   = (known after apply)
              + type = "Scope"
            }
          + resource_access {
              + id   = (known after apply)
              + type = "Scope"
            }
        }

      + web {
          + redirect_uris = [
              + "https://argocd.homecentr.one/auth/callback",
            ]
        }
    }

  # azuread_application.pomerium will be created
  + resource "azuread_application" "pomerium" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "Pomerium"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 2
        }

      + feature_tags {
          + enterprise = true
          + gallery    = false
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = (known after apply)
              + type = "Scope"
            }
          + resource_access {
              + id   = (known after apply)
              + type = "Role"
            }
          + resource_access {
              + id   = (known after apply)
              + type = "Role"
            }
          + resource_access {
              + id   = (known after apply)
              + type = "Role"
            }
        }

      + web {
          + redirect_uris = [
              + "https://login.homecentr.one/oauth2/callback",
            ]
        }
    }

  # azuread_application.proxmox will be created
  + resource "azuread_application" "proxmox" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "Proxmox VE"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 2
        }

      + feature_tags {
          + enterprise = true
          + gallery    = false
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = (known after apply)
              + type = "Scope"
            }
          + resource_access {
              + id   = (known after apply)
              + type = "Scope"
            }
        }

      + web {
          + redirect_uris = [
              + "https://pve.homecentr.one/",
              + "https://pve1.homecentr.one/",
              + "https://pve2.homecentr.one/",
              + "https://pve3.homecentr.one/",
            ]
        }
    }

  # azuread_group.administrators will be created
  + resource "azuread_group" "administrators" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "Administrators"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = false
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = [
          + "74953878-8eaf-421b-b557-b2485367566c",
        ]
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # azuread_group.users will be created
  + resource "azuread_group" "users" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "Users"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = false
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = [
          + "74953878-8eaf-421b-b557-b2485367566c",
        ]
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # azuread_group_member.administrators_admin will be created
  + resource "azuread_group_member" "administrators_admin" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "74953878-8eaf-421b-b557-b2485367566c"
    }

  # azuread_group_member.users_administrators will be created
  + resource "azuread_group_member" "users_administrators" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # azuread_service_principal.argocd will be created
  + resource "azuread_service_principal" "argocd" {
      + account_enabled              = true
      + app_role_assignment_required = true
      + app_role_ids                 = (known after apply)
      + app_roles                    = (known after apply)
      + application_id               = (known after apply)
      + application_tenant_id        = (known after apply)
      + display_name                 = (known after apply)
      + homepage_url                 = (known after apply)
      + id                           = (known after apply)
      + logout_url                   = (known after apply)
      + oauth2_permission_scope_ids  = (known after apply)
      + oauth2_permission_scopes     = (known after apply)
      + object_id                    = (known after apply)
      + owners                       = [
          + "74953878-8eaf-421b-b557-b2485367566c",
        ]
      + redirect_uris                = (known after apply)
      + saml_metadata_url            = (known after apply)
      + service_principal_names      = (known after apply)
      + sign_in_audience             = (known after apply)
      + tags                         = (known after apply)
      + type                         = (known after apply)

      + feature_tags {
          + enterprise = true
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # azuread_service_principal.msgraph will be created
  + resource "azuread_service_principal" "msgraph" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = "00000003-0000-0000-c000-000000000000"
      + application_tenant_id       = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
      + use_existing                = true

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # azuread_service_principal.pomerium will be created
  + resource "azuread_service_principal" "pomerium" {
      + account_enabled              = true
      + app_role_assignment_required = true
      + app_role_ids                 = (known after apply)
      + app_roles                    = (known after apply)
      + application_id               = (known after apply)
      + application_tenant_id        = (known after apply)
      + display_name                 = (known after apply)
      + homepage_url                 = (known after apply)
      + id                           = (known after apply)
      + logout_url                   = (known after apply)
      + oauth2_permission_scope_ids  = (known after apply)
      + oauth2_permission_scopes     = (known after apply)
      + object_id                    = (known after apply)
      + owners                       = [
          + "74953878-8eaf-421b-b557-b2485367566c",
        ]
      + redirect_uris                = (known after apply)
      + saml_metadata_url            = (known after apply)
      + service_principal_names      = (known after apply)
      + sign_in_audience             = (known after apply)
      + tags                         = (known after apply)
      + type                         = (known after apply)

      + feature_tags {
          + enterprise = true
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # azuread_service_principal.proxmox will be created
  + resource "azuread_service_principal" "proxmox" {
      + account_enabled              = true
      + app_role_assignment_required = true
      + app_role_ids                 = (known after apply)
      + app_roles                    = (known after apply)
      + application_id               = (known after apply)
      + application_tenant_id        = (known after apply)
      + display_name                 = (known after apply)
      + homepage_url                 = (known after apply)
      + id                           = (known after apply)
      + logout_url                   = (known after apply)
      + oauth2_permission_scope_ids  = (known after apply)
      + oauth2_permission_scopes     = (known after apply)
      + object_id                    = (known after apply)
      + owners                       = [
          + "74953878-8eaf-421b-b557-b2485367566c",
        ]
      + redirect_uris                = (known after apply)
      + saml_metadata_url            = (known after apply)
      + service_principal_names      = (known after apply)
      + sign_in_audience             = (known after apply)
      + tags                         = (known after apply)
      + type                         = (known after apply)

      + feature_tags {
          + enterprise = true
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # azuread_service_principal_delegated_permission_grant.argocd will be created
  + resource "azuread_service_principal_delegated_permission_grant" "argocd" {
      + claim_values                         = [
          + "offline_access",
          + "openid",
        ]
      + id                                   = (known after apply)
      + resource_service_principal_object_id = (known after apply)
      + service_principal_object_id          = (known after apply)
    }

  # azuread_service_principal_delegated_permission_grant.pomerium will be created
  + resource "azuread_service_principal_delegated_permission_grant" "pomerium" {
      + claim_values                         = [
          + "Directory.Read.All",
          + "Group.Read.All",
          + "User.Read",
          + "User.Read.All",
        ]
      + id                                   = (known after apply)
      + resource_service_principal_object_id = (known after apply)
      + service_principal_object_id          = (known after apply)
    }

  # azuread_service_principal_delegated_permission_grant.proxmox will be created
  + resource "azuread_service_principal_delegated_permission_grant" "proxmox" {
      + claim_values                         = [
          + "offline_access",
          + "openid",
        ]
      + id                                   = (known after apply)
      + resource_service_principal_object_id = (known after apply)
      + service_principal_object_id          = (known after apply)
    }

Plan: 17 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @lholota, Action: `pull_request`*